scc2425-tukano/src/main/test/scc2425-artillery-tests/realistic_flow_out.txt
Test run id: tq6g4_e7pwbpmdhfz8ajx7njwffbatjhghq_dt55
Parsed 201 rows
Parsed 201 rows
Parsed 201 rows
[...]
Phase started: Warm up (index: 0, duration: 10s) 18:55:26(+0000)

Phase completed: Warm up (index: 0, duration: 10s) 18:55:36(+0000)

--------------------------------------
Metrics for period to: 18:55:30(+0000) (width: 2.759s)
--------------------------------------

http.codes.200: ................................................................ 1
http.codes.403: ................................................................ 1
http.codes.404: ................................................................ 3
http.downloaded_bytes: ......................................................... 2
http.request_rate: ............................................................. 3/sec
http.requests: ................................................................. 5
http.response_time:
  min: ......................................................................... 4
  max: ......................................................................... 1246
  mean: ........................................................................ 592.2
  median: ...................................................................... 596
  p95: ......................................................................... 685.5
  p99: ......................................................................... 685.5
http.response_time.2xx:
  min: ......................................................................... 682
  max: ......................................................................... 682
  mean: ........................................................................ 682
  median: ...................................................................... 685.5
  p95: ......................................................................... 685.5
  p99: ......................................................................... 685.5
http.response_time.4xx:
  min: ......................................................................... 4
  max: ......................................................................... 1246
  mean: ........................................................................ 569.8
  median: ...................................................................... 432.7
  p95: ......................................................................... 596
  p99: ......................................................................... 596
http.responses: ................................................................ 5
plugins.metrics-by-endpoint./tukano/rest/blobs/{{ blobUrl }}.codes.403: ........ 1
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ shortId }}.codes.404: ....... 1
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ shortId }}/likes?pwd={{ p...  1
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ shortId }}/{{ userId }}/l...  1
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ userId }}/feed?pwd={{ pwd...  1
plugins.metrics-by-endpoint.response_time./tukano/rest/blobs/{{ blobUrl }}:
  min: ......................................................................... 4
  max: ......................................................................... 4
  mean: ........................................................................ 4
  median: ...................................................................... 4
  p95: ......................................................................... 4
  p99: ......................................................................... 4
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ shortId }}:
  min: ......................................................................... 436
  max: ......................................................................... 436
  mean: ........................................................................ 436
  median: ...................................................................... 432.7
  p95: ......................................................................... 432.7
  p99: ......................................................................... 432.7
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ shortId }}/likes?pwd={{ pwd }}:
  min: ......................................................................... 593
  max: ......................................................................... 593
  mean: ........................................................................ 593
  median: ...................................................................... 596
  p95: ......................................................................... 596
  p99: ......................................................................... 596
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ shortId }}/{{ userId }}/likes?pwd={{ pwd }}:
  min: ......................................................................... 1246
  max: ......................................................................... 1246
  mean: ........................................................................ 1246
  median: ...................................................................... 1249.1
  p95: ......................................................................... 1249.1
  p99: ......................................................................... 1249.1
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ userId }}/feed?pwd={{ pwd }}:
  min: ......................................................................... 682
  max: ......................................................................... 682
  mean: ........................................................................ 682
  median: ...................................................................... 685.5
  p95: ......................................................................... 685.5
  p99: ......................................................................... 685.5
vusers.completed: .............................................................. 4
vusers.created: ................................................................ 4
vusers.created_by_name.Download short: ......................................... 1
vusers.created_by_name.Get Short Likes: ........................................ 1
vusers.created_by_name.Like short: ............................................. 1
vusers.created_by_name.View feed: .............................................. 1
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 450.7
  max: ......................................................................... 1267
  mean: ........................................................................ 754.5
  median: ...................................................................... 596
  p95: ......................................................................... 699.4
  p99: ......................................................................... 699.4


--------------------------------------
Metrics for period to: 18:55:40(+0000) (width: 6.752s)
--------------------------------------

http.codes.200: ................................................................ 23
http.codes.204: ................................................................ 4
http.codes.403: ................................................................ 2
http.codes.404: ................................................................ 4
http.codes.500: ................................................................ 1
http.downloaded_bytes: ......................................................... 218035
http.request_rate: ............................................................. 9/sec
http.requests: ................................................................. 34
http.response_time:
  min: ......................................................................... 4
  max: ......................................................................... 1000
  mean: ........................................................................ 348
  median: ...................................................................... 314.2
  p95: ......................................................................... 528.6
  p99: ......................................................................... 658.6
http.response_time.2xx:
  min: ......................................................................... 71
  max: ......................................................................... 658
  mean: ........................................................................ 339.3
  median: ...................................................................... 301.9
  p95: ......................................................................... 487.9
  p99: ......................................................................... 528.6
http.response_time.4xx:
  min: ......................................................................... 4
  max: ......................................................................... 441
  mean: ........................................................................ 278.7
  median: ...................................................................... 391.6
  p95: ......................................................................... 415.8
  p99: ......................................................................... 415.8
http.response_time.5xx:
  min: ......................................................................... 1000
  max: ......................................................................... 1000
  mean: ........................................................................ 1000
  median: ...................................................................... 1002.4
  p95: ......................................................................... 1002.4
  p99: ......................................................................... 1002.4
http.responses: ................................................................ 34
plugins.metrics-by-endpoint./tukano/rest/blobs/{{ blobUrl }}.codes.200: ........ 3
plugins.metrics-by-endpoint./tukano/rest/blobs/{{ blobUrl }}.codes.204: ........ 3
plugins.metrics-by-endpoint./tukano/rest/blobs/{{ blobUrl }}.codes.403: ........ 2
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ shortId }}.codes.200: ....... 3
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ shortId }}.codes.404: ....... 2
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ shortId }}/likes?pwd={{ p...  1
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ shortId }}/{{ userId }}/l...  2
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ userId }}/feed?pwd={{ pwd...  12
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ userId }}/shorts.codes.200: . 2
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ userId }}?pwd={{ pwd }}.c...  3
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ userId1 }}/{{ userId2 }}/...  1
plugins.metrics-by-endpoint.response_time./tukano/rest/blobs/{{ blobUrl }}:
  min: ......................................................................... 4
  max: ......................................................................... 442
  mean: ........................................................................ 169.1
  median: ...................................................................... 80.6
  p95: ......................................................................... 361.5
  p99: ......................................................................... 361.5
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ shortId }}:
  min: ......................................................................... 388
  max: ......................................................................... 658
  mean: ........................................................................ 465.2
  median: ...................................................................... 432.7
  p95: ......................................................................... 432.7
  p99: ......................................................................... 432.7
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ shortId }}/likes?pwd={{ pwd }}:
  min: ......................................................................... 1000
  max: ......................................................................... 1000
  mean: ........................................................................ 1000
  median: ...................................................................... 1002.4
  p95: ......................................................................... 1002.4
  p99: ......................................................................... 1002.4
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ shortId }}/{{ userId }}/likes?pwd={{ pwd }}:
  min: ......................................................................... 419
  max: ......................................................................... 441
  mean: ........................................................................ 430
  median: ...................................................................... 415.8
  p95: ......................................................................... 415.8
  p99: ......................................................................... 415.8
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ userId }}/feed?pwd={{ pwd }}:
  min: ......................................................................... 278
  max: ......................................................................... 531
  mean: ........................................................................ 325.4
  median: ...................................................................... 290.1
  p95: ......................................................................... 424.2
  p99: ......................................................................... 424.2
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ userId }}/shorts:
  min: ......................................................................... 284
  max: ......................................................................... 301
  mean: ........................................................................ 292.5
  median: ...................................................................... 284.3
  p95: ......................................................................... 284.3
  p99: ......................................................................... 284.3
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 444
  max: ......................................................................... 492
  mean: ........................................................................ 467
  median: ...................................................................... 468.8
  p95: ......................................................................... 468.8
  p99: ......................................................................... 468.8
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ userId1 }}/{{ userId2 }}/followers?pwd={{ pwd }}:
  min: ......................................................................... 403
  max: ......................................................................... 403
  mean: ........................................................................ 403
  median: ...................................................................... 399.5
  p95: ......................................................................... 399.5
  p99: ......................................................................... 399.5
vusers.completed: .............................................................. 26
vusers.created: ................................................................ 26
vusers.created_by_name.Download short: ......................................... 5
vusers.created_by_name.Follow user: ............................................ 1
vusers.created_by_name.Get Short Likes: ........................................ 1
vusers.created_by_name.Get User's Shorts: ...................................... 2
vusers.created_by_name.Like short: ............................................. 2
vusers.created_by_name.Upload short: ........................................... 3
vusers.created_by_name.View feed: .............................................. 12
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 283.3
  max: ......................................................................... 1005.9
  mean: ........................................................................ 464.9
  median: ...................................................................... 399.5
  p95: ......................................................................... 854.2
  p99: ......................................................................... 889.1


All VUs finished. Total time: 11 seconds

--------------------------------
Summary report @ 18:55:38(+0000)
--------------------------------

http.codes.200: ................................................................ 24
http.codes.204: ................................................................ 4
http.codes.403: ................................................................ 3
http.codes.404: ................................................................ 7
http.codes.500: ................................................................ 1
http.downloaded_bytes: ......................................................... 218037
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 39
http.response_time:
  min: ......................................................................... 4
  max: ......................................................................... 1246
  mean: ........................................................................ 379.3
  median: ...................................................................... 361.5
  p95: ......................................................................... 685.5
  p99: ......................................................................... 1002.4
http.response_time.2xx:
  min: ......................................................................... 71
  max: ......................................................................... 682
  mean: ........................................................................ 351.5
  median: ...................................................................... 301.9
  p95: ......................................................................... 528.6
  p99: ......................................................................... 658.6
http.response_time.4xx:
  min: ......................................................................... 4
  max: ......................................................................... 1246
  mean: ........................................................................ 395.1
  median: ...................................................................... 415.8
  p95: ......................................................................... 596
  p99: ......................................................................... 596
http.response_time.5xx:
  min: ......................................................................... 1000
  max: ......................................................................... 1000
  mean: ........................................................................ 1000
  median: ...................................................................... 1002.4
  p95: ......................................................................... 1002.4
  p99: ......................................................................... 1002.4
http.responses: ................................................................ 39
plugins.metrics-by-endpoint./tukano/rest/blobs/{{ blobUrl }}.codes.200: ........ 3
plugins.metrics-by-endpoint./tukano/rest/blobs/{{ blobUrl }}.codes.204: ........ 3
plugins.metrics-by-endpoint./tukano/rest/blobs/{{ blobUrl }}.codes.403: ........ 3
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ shortId }}.codes.200: ....... 3
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ shortId }}.codes.404: ....... 3
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ shortId }}/likes?pwd={{ p...  1
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ shortId }}/likes?pwd={{ p...  1
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ shortId }}/{{ userId }}/l...  3
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ userId }}/feed?pwd={{ pwd...  13
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ userId }}/shorts.codes.200: . 2
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ userId }}?pwd={{ pwd }}.c...  3
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ userId1 }}/{{ userId2 }}/...  1
plugins.metrics-by-endpoint.response_time./tukano/rest/blobs/{{ blobUrl }}:
  min: ......................................................................... 4
  max: ......................................................................... 442
  mean: ........................................................................ 150.8
  median: ...................................................................... 80.6
  p95: ......................................................................... 361.5
  p99: ......................................................................... 361.5
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ shortId }}:
  min: ......................................................................... 388
  max: ......................................................................... 658
  mean: ........................................................................ 460.3
  median: ...................................................................... 432.7
  p95: ......................................................................... 432.7
  p99: ......................................................................... 432.7
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ shortId }}/likes?pwd={{ pwd }}:
  min: ......................................................................... 593
  max: ......................................................................... 1000
  mean: ........................................................................ 796.5
  median: ...................................................................... 596
  p95: ......................................................................... 596
  p99: ......................................................................... 596
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ shortId }}/{{ userId }}/likes?pwd={{ pwd }}:
  min: ......................................................................... 419
  max: ......................................................................... 1246
  mean: ........................................................................ 702
  median: ...................................................................... 441.5
  p95: ......................................................................... 441.5
  p99: ......................................................................... 441.5
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ userId }}/feed?pwd={{ pwd }}:
  min: ......................................................................... 278
  max: ......................................................................... 682
  mean: ........................................................................ 352.8
  median: ...................................................................... 295.9
  p95: ......................................................................... 528.6
  p99: ......................................................................... 528.6
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ userId }}/shorts:
  min: ......................................................................... 284
  max: ......................................................................... 301
  mean: ........................................................................ 292.5
  median: ...................................................................... 284.3
  p95: ......................................................................... 284.3
  p99: ......................................................................... 284.3
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 444
  max: ......................................................................... 492
  mean: ........................................................................ 467
  median: ...................................................................... 468.8
  p95: ......................................................................... 468.8
  p99: ......................................................................... 468.8
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ userId1 }}/{{ userId2 }}/followers?pwd={{ pwd }}:
  min: ......................................................................... 403
  max: ......................................................................... 403
  mean: ........................................................................ 403
  median: ...................................................................... 399.5
  p95: ......................................................................... 399.5
  p99: ......................................................................... 399.5
vusers.completed: .............................................................. 30
vusers.created: ................................................................ 30
vusers.created_by_name.Download short: ......................................... 6
vusers.created_by_name.Follow user: ............................................ 1
vusers.created_by_name.Get Short Likes: ........................................ 2
vusers.created_by_name.Get User's Shorts: ...................................... 2
vusers.created_by_name.Like short: ............................................. 3
vusers.created_by_name.Upload short: ........................................... 3
vusers.created_by_name.View feed: .............................................. 13
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 283.3
  max: ......................................................................... 1267
  mean: ........................................................................ 503.6
  median: ...................................................................... 424.2
  p95: ......................................................................... 889.1
  p99: ......................................................................... 1002.4